WiseLabCMU/Beluga/nRF5_SDK_14.2.0_17b948a/examples/ble_central_and_peripheral/experimental/ble_app_hrs_rscs_relay/main.c
#define APP_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2        /**< Reply when unsupported features are requested. */

#define SEC_PARAM_BOND                  1                                           /**< Perform bonding. */
#define SEC_PARAM_MITM                  0                                           /**< Man In The Middle protection not required. */
#define SEC_PARAM_LESC                  0                                           /**< LE Secure Connections not enabled. */
#define SEC_PARAM_KEYPRESS              0                                           /**< Keypress notifications not enabled. */
#define SEC_PARAM_IO_CAPABILITIES       BLE_GAP_IO_CAPS_NONE                        /**< No I/O capabilities. */
#define SEC_PARAM_OOB                   0                                           /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE          7                                           /**< Minimum encryption key size in octets. */
#define SEC_PARAM_MAX_KEY_SIZE          16                                          /**< Maximum encryption key size in octets. */

#define SCAN_INTERVAL                   0x00A0                                      /**< Determines scan interval in units of 0.625 millisecond. */
#define SCAN_WINDOW                     0x0050                                      /**< Determines scan window in units of 0.625 millisecond. */
#define SCAN_TIMEOUT                    0

#define MIN_CONNECTION_INTERVAL         (uint16_t) MSEC_TO_UNITS(7.5, UNIT_1_25_MS) /**< Determines minimum connection interval in milliseconds. */
#define MAX_CONNECTION_INTERVAL         (uint16_t) MSEC_TO_UNITS(30, UNIT_1_25_MS)  /**< Determines maximum connection interval in milliseconds. */
#define SLAVE_LATENCY                   0                                           /**< Determines slave latency in terms of connection events. */
#define SUPERVISION_TIMEOUT             (uint16_t) MSEC_TO_UNITS(4000, UNIT_10_MS)  /**< Determines supervision time-out in units of 10 milliseconds. */

#define UUID16_SIZE                     2                                           /**< Size of a UUID, in bytes. */

/**@brief   Priority of the application BLE event handler.
 * @note    You shouldn't need to modify this value.
 */
#define APP_BLE_OBSERVER_PRIO           3

/**@brief Macro to unpack 16bit unsigned UUID from an octet stream.
 */
#define UUID16_EXTRACT(DST, SRC) \
    do                           \
    {                            \
        (*(DST))   = (SRC)[1];   \
        (*(DST)) <<= 8;          \
        (*(DST))  |= (SRC)[0];   \
    } while (0)


/**@brief Variable length data encapsulation in terms of length and pointer to data. */
typedef struct
{
    uint8_t  * p_data;   /**< Pointer to data. */
    uint16_t   data_len; /**< Length of data. */
} data_t;


static bool in_seen_list(uint16_t UUID);



static ble_hrs_t m_hrs;                                             /**< Heart rate service instance. */
static ble_rscs_t m_rscs;                                           /**< Running speed and cadence service instance. */
static ble_hrs_c_t m_hrs_c;                                         /**< Heart rate service client instance. */
static ble_rscs_c_t m_rscs_c;                                       /**< Running speed and cadence service client instance. */

NRF_BLE_GATT_DEF(m_gatt);                                           /**< GATT module instance. */
BLE_ADVERTISING_DEF(m_advertising);                                 /**< Advertising module instance. */
BLE_DB_DISCOVERY_ARRAY_DEF(m_db_discovery, 2);                      /**< Database discovery module instances. */

static uint16_t m_conn_handle_hrs_c  = BLE_CONN_HANDLE_INVALID;     /**< Connection handle for the HRS central application */
static uint16_t m_conn_handle_rscs_c = BLE_CONN_HANDLE_INVALID;     /**< Connection handle for the RSC central application */

/**@brief names which the central applications will scan for, and which will be advertised by the peripherals.
 *  if these are set to empty strings, the UUIDs defined below will be used
 */
static char const m_target_periph_name[] = "Node";

/**@brief UUIDs which the central applications will scan for if the name above is set to an empty string,
 * and which will be advertised by the peripherals.
 */
#define MAX_ANCHOR_COUNT 8

static int range_flag;
#define NODE_ID             0x1000
#define UUID_INDICATOR 0x1800 
#define BLE_UWB_RANGE0 0x0000
#define BLE_UWB_RANGE1 0x0000
#define BLE_UWB_RANGE2 0x0000
static ble_uuid_t m_adv_uuids[] =
{
    {UUID_INDICATOR              , BLE_UUID_TYPE_BLE},
    {NODE_ID      , BLE_UUID_TYPE_BLE}
    //{BLE_UWB_RANGE0             , BLE_UUID_TYPE_BLE},
    //{BLE_UWB_RANGE1             , BLE_UUID_TYPE_BLE},
    //{BLE_UWB_RANGE2             , BLE_UUID_TYPE_BLE}
     
};
//static int BLE_UWB_RANGE = 0;



/*
static ble_uuid_t m_adv_uuids[] =
{
    {BLE_UUID_HEART_RATE_SERVICE,        BLE_UUID_TYPE_BLE},
    {BLE_UUID_RUNNING_SPEED_AND_CADENCE, BLE_UUID_TYPE_BLE},
    {BLE_UUID_SYSTEM_ADDED             , BLE_UUID_TYPE_BLE},
    {BLE_UWB_RANGE                     , BLE_UUID_TYPE_VENDOR_BEGIN}
};
*/



/**@brief Parameters used when scanning. */
static ble_gap_scan_params_t const m_scan_params =
{
    .active   = 1,
    .interval = SCAN_INTERVAL,
    .window   = SCAN_WINDOW,
    .timeout  = SCAN_TIMEOUT,
    #if (NRF_SD_BLE_API_VERSION <= 2)
        .selective   = 0,
        .p_whitelist = NULL,
    #endif
    #if (NRF_SD_BLE_API_VERSION >= 3)
        .use_whitelist = 0,
    #endif
};

/**@brief Connection parameters requested for connection. */
static ble_gap_conn_params_t const m_connection_param =
{
    MIN_CONNECTION_INTERVAL,
    MAX_CONNECTION_INTERVAL,
    SLAVE_LATENCY,
    SUPERVISION_TIMEOUT
};





typedef struct node{
    int UUID;
    int8_t RSSI;
    int time_stamp;
    float range;
} node;

node seen_list[MAX_ANCHOR_COUNT];
int last_seen_idx = 0;



/*
bool in_list(int i)
{
  for(int j = 0; j < MAX_ANCHOR_COUNT; j++)
  {
    if(seen_list[j] == i) return true;
  }
  return false;
}
*/

void print_seen_list()
{

  printf("#######################\r\n");
  for(int j = 0; j < MAX_ANCHOR_COUNT; j++)
  {
    printf("%d) UUID: %x RSSI: %d Time Stamp: %d \r\n",j, seen_list[j].UUID, seen_list[j].RSSI, seen_list[j].time_stamp);
  }
  printf("#######################\r\n");
}




//-----------------dw1000----------------------------
/*DW1000 config function*/
static dwt_config_t config = {
    5,                /* Channel number. */
    DWT_PRF_64M,      /* Pulse repetition frequency. */
    DWT_PLEN_128,     /* Preamble length. Used in TX only. */
    DWT_PAC8,         /* Preamble acquisition chunk size. Used in RX only. */
    10,               /* TX preamble code. Used in TX only. */
    10,               /* RX preamble code. Used in RX only. */
    0,                /* 0 to use standard SFD, 1 to use non-standard SFD. */
    DWT_BR_6M8,       /* Data rate. */
    DWT_PHRMODE_STD,  /* PHY header mode. */
    (129 + 8 - 8)     /* SFD timeout (preamble length + 1 + SFD length - PAC size). Used in RX only. */
};

