WiseLabCMU/Beluga/nRF5_SDK_14.2.0_17b948a/examples/ble_central_and_peripheral/experimental/ble_app_hrs_rscs_relay/main.c
    else{
      printf("Switching to ADVERTISER\r\n");
      //wait for specified amount of time
      //Start Advertising again and stop scanning
      sd_ble_gap_scan_stop();
      ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
      //stop scanning
      
      role = ADVERTISER;
    }

    
    
}


static void lfclk_request(void)
{
    ret_code_t err_code = nrf_drv_clock_init();
    APP_ERROR_CHECK(err_code);
    nrf_drv_clock_lfclk_request(NULL);
}


bool in_seen_list(uint16_t UUID){

  for(int i = 0; i < MAX_ANCHOR_COUNT; i++){

    if(seen_list[i].UUID == UUID){
      
      return true;
      
      }
  }

  return false;

}


int main(void)
{
    role = ADVERTISER;
    for(int i = 0; i < MAX_ANCHOR_COUNT; i++)
    {
      seen_list[i].UUID = 0;
      seen_list[i].RSSI = 0;
      seen_list[i].time_stamp = 0;
      seen_list[i].range = 0;
    }


    mode = INITIATOR;
    bool erase_bonds;
    range_flag = 0;
    
    vInterruptInit();
    boUART_Init();
    //log_init();
    timer_init();
    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    gatt_init();
    conn_params_init();
    db_discovery_init();
    peer_manager_init();
    hrs_c_init();
    rscs_c_init();
    services_init();
    advertising_init();



    ret_code_t create_timer = app_timer_create(&m_timestamp_keeper, APP_TIMER_MODE_REPEATED, timestamp_handler);
    ret_code_t start_timer =  app_timer_start(m_timestamp_keeper, APP_TIMER_TICKS(1000) , NULL);
  
    
    
    
    ret_code_t c2 = app_timer_create(&m_ble_switch, APP_TIMER_MODE_REPEATED, switch_ble);
    ret_code_t s2 = app_timer_start(m_ble_switch,APP_TIMER_TICKS(5000) ,NULL);

    

    

    LEDS_CONFIGURE(BSP_LED_0_MASK | BSP_LED_1_MASK | BSP_LED_2_MASK);
    LEDS_ON(BSP_LED_0_MASK | BSP_LED_1_MASK | BSP_LED_2_MASK );


    reset_DW1000(); 
    port_set_dw1000_slowrate();			
  
    /* Init the DW1000 */
    if (dwt_initialise(DWT_LOADUCODE) == DWT_ERROR)
    {
      //Init of DW1000 Failed
      while (1) {};   //Here is a wait that occurs if DW1000 init fails
    }

    // Set SPI to 8MHz clock  
    port_set_dw1000_fastrate();

    /* Configure DW1000. */
    dwt_configure(&config);
    //dwt_setcallbacks(&tx_conf_cb, &rx_ok_cb, &rx_to_cb, &rx_err_cb);

    //dwt_setinterrupt(DWT_INT_TFRS | DWT_INT_RFCG | DWT_INT_RFTO | DWT_INT_RXPTO | DWT_INT_RPHE | DWT_INT_RFCE | DWT_INT_RFSL | DWT_INT_SFDT, 1);

    /* Apply default antenna delay value. See NOTE 2 below. */
    dwt_setrxantennadelay(RX_ANT_DLY);
    dwt_settxantennadelay(TX_ANT_DLY);

    /* Set preamble timeout for expected frames. See NOTE 3 below. */
    //dwt_setpreambledetecttimeout(0); // PRE_TIMEOUT
          
    /* Set expected response's delay and timeout. 
    * As this example only handles one incoming frame with always the same delay and timeout, those values can be set here once for all. */
    dwt_setrxaftertxdelay(POLL_TX_TO_RESP_RX_DLY_UUS);
    dwt_setrxtimeout(65000); // Maximum value timeout with DW1000 is 65ms
    printf("HELP\r\n");
    
    
   
    
    if (erase_bonds == true)
    {
        // Scanning and advertising is done upon PM_EVT_PEERS_DELETE_SUCCEEDED event.
        delete_bonds();
        // Scanning and advertising is done by
    }
    else
    {
        //adv_scan_start();
    }
    int count = 0;
    NRF_LOG_INFO("Relay example started.");
    

    int switching_timer; //Switching Between BLE scanner/broadcaster
    int x = 1;
    while(1) 
    {
        


        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
            nrf_delay_ms(1000);
            //first, stop advertising and continue scanning;
            if(x == 1)
            {
              
              sd_ble_gap_scan_start(&m_scan_params);
              sd_ble_gap_adv_stop();
              nrf_delay_ms(5000);
              //wait for specified amount of time
              //Start Advertising again and stop scanning
              ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
              //stop scanning
              sd_ble_gap_scan_stop();
              
              x = 0;
              }
             /*
             if(range_flag == 1)
             {

              if(mode == RESPONDER)
              {
                float range = ds_resp_run();
               }

              else if(mode == INITIATOR)
              {
                ds_init_run();
              }
              range_flag = 0;
            }
            */
            
        }
    }
    
}
